aa
aaa
able
about
above
absolute
absolutely
absurdly
abt
accept
acceptable
accepted
access
accessed
accessible
accessing
accessories
accessory
accidentally
accidently
according
account
accurate
accustomed
acquainted
across
act
action
activated
active
actual
actually
adapt
adapter
adapters
adaptor
add
added
adding
addition
additional
address
adopter
adsl
advanced
advantage
advertised
advertisement
advice
advisable
affordable
after
again
against
ago
ahead
ahmedabad
aio
air
airtel
alkaline
alkline
all
all in one
allocation
allow
allowed
allowing
allows
almost
alone
along
alot
alphabetically
already
alright
also
alt
although
always
am
amazed
amazing
amazingly
amazon
amazon  very
amazon com
amazon in
amazone
amazone in
amazons
american
among
amount
amp
an
and
andriod
android
angles
annoying
another
antena
antenna
antennas
antivirus
any
anybody
anymore
anyone
anything
anyways
anywhere
ap
apart
apartment
app
appears
apple
applicable
application
applications
applied
appropriate
approx
approx there
apps
arch
archlinux
are
area
around
arrange
arrival
arrived
arrow
arrow navigation
artistx
as
ash
ask
asked
asking
aspect
associated
assurance
asus
at
atlast
atleast
attached
attain
attempts
attract
attractive
audio
aug
august
aur
authenticity
authorized
auto
automatic
automatically
avail
available
average
avoid
avoiding
aware
away
awesome
awsome  mobile  handy  good
b g n
b w
back
back the
backpack
backspace
backup
bad
bag
balck
ball
band
bandwidth
bang
bangalore
bar
barely
bargain
bars
base
based
basic
batteries
battery
bcos
bcoz
be
beautiful
beauty
became
because
become
becomes
bed
bedroom
been
before
began
beginning
behave
being
believe
belkin
belongs
below
bench
benchmarkinng
beneath
besides
best
better
between
beware
beyond
bhk
big
bigger
biggest
bike
bill
bin
bios
bit
black
black white
blade
blue
bluetooth
board
body
booked
boost
boosting
boots
borderless
both
bottom
bought
bounce
bound
bout
box
boy
bracket
brand
branded
brands
break
breeze
bridging
bright
bring
bro
broadband
brother
brought
browse
browser
browsing
bsnl
bt
buck
bucks
bucks after
budget
buffer
buffering
build
building
built
bulky
bunch
bundled
business
busy
but
button
buttons
buy
buyed
buyers
buying
by
ca
cabin
cable
cad
cake
cal
calculator
call
called
calls
came
camera
cams
can
canon
cant
cap
capability
capable
capacity
caps
caps scroll
capslock
captures
car
card
cards
care
careful
carefully
carry
carrying
cartridge
cartridges
case
cash
cashback
cashkaro
cashkaro com r
casing
casual
cause
causing
caution
cd
ceiling
cells
center
centers
centre
centres
certain
certainly
cf wu   n
chain
chance
change
changed
changes
changing
charge
charged
charges
charm
chat
cheap
cheaper
cheapest
cheated
cheating
check
checked
checking
cheers
china
chinese
chipset
choice
choose
chromebook
circute
cisco
citibank
city
claim
claimed
claims
class
classy
clean
clear
clearly
click
clicking
clicks
clone
close
closed
closely
cloud
cloudtail
cm
coarse
coasting
cod
code
coffee
collect
color
colour
combo
comes
comfast
comfort
comfortable
comfortably
coming
command
commendable
comment
comments
common
communicating
compact
compactness
companies
companion
company
comparatively
compare
compared
comparing
comparison
compatibility
compatible
competition
competitive
competitively
competitors
complain
complaining
complaint
complaints
complementing
complete
completely
computer
computers
con
concern
concerned
conclude
concluded
concrete
condition
conditions
config
configuration
configurations
configure
configured
configuring
confirm
confirmed
conflicts
confused
connct
connect
connected
connecting
connection
connections
connectivity
connector
connectors
connects
cons
conserve
consider
considerably
considered
considering
consistent
constant
constantly
consume
consumer
consumes
consumption
contact
contacted
contain
content
contents
context
continued
continuous
continuously
control
controlled
controlling
convenience
convenient
conventional
convert
converted
cool
copied
copies
copy
copying
cord
cordless
corner
correct
corresponding
corrupt
corrupted
cost
costed
costing
costlier
costly
costs
could
counterparts
couple
courier
course
court
courthage
cover
coverage
covered
covers
coz
cpu
crammed
cramped
crap
crashed
crazy
create
creates
creating
credit
crisp
crossed
crowded
cruzer
cry
crystaldiskmark
cum
current
currently
cursor
custom
customer
customers
customizable
customize
customized
cute
cycle
d link
daily
dam
damage
damaged
damn
dark
dat
data
data internet
date
days
dbi
dd
dd wrt
dead
deal
deal friends
dealer
dealing
deals
dear
debian
debit
dec
decent
decide
decided
decision
decrease
decreased
dedicated
deducted
default
defected
defective
definitely
degrade
delay
delete
delevery
delhi
delicate
delight
delighted
deliver
delivered
delivering
delivery
delkin
dell
denims
depend
depends
descent
description
deserves
design
design  mouse
designed
desired
desk
deskjet
desktop
despite
destination
detachable
details
detect
detected
detecting
detects
detergent
development
device
devices
di
did
didnot
didnt
died
difference
different
differently
difficult
difficulties
difficulty
digital
dimensions
direct
direction
directly
dirty
dis
disappointed
disappointing
disappointment
disc
disconnect
disconnected
disconnection
disconnects
disk
dislike
display
displayed
displaying
dissapointed
distance
diwali
dlink
dnt
do
document
documents
does
doesnot
doesnt
doest
doing
done
dongle
donno
donot
dont
door
doors
double
double sided
doubt
down
download
downloaded
downloading
dpi
draft
drains
drawback
drawbacks
dream
drive
driver
drivers
drives
drop
dropped
dropping
drops
dry
dsl
dual
due
duplex
duplicate
duplicates
durability
durable
duracell
during
dust
duty
dynamic
e all in one
e commerce
e g
e printing
each
earlier
early
ease
easier
easily
easy
eating
economical
edge
edges
effect
effective
efficiency
efficient
effortless
either
electronic
electronics
elegant
eligible
elite
else
email
emails
empty
enabled
encased
encourages
end
ended
ends
energy
engineer
enjoy
enjoying
enough
ensure
enter
entire
entry
ep
eprint
eprinter
equal
erase
ergonomic
ergonomics
error
errors
es
especially
estimated
etc
ether
ethernet
evaporated
even
ever
every
everyday
everyone
everything
everywhere
evo
exactly
example
exceeded
excellent
except
exceptional
exchange
excited
expand
expect
expectation
expectations
expected
expecting
expensive
experience
experienced
expired
explained
explorer
extender
extensively
external
extra
extreme
extremely
eye
eyes
fabrics
face
faced
facility
facing
fact
factor
fail
failed
fair
fairly
faith
fake
fall
family
fan
fantastic
far
farthest
fast
faster
fastest
fat
fault
faulty
feature
features
feb
feedback
feel
feeling
feels
feet
felt
few
fibernet
field
fighting
figure
figured
file
files
fill
fills
finally
find
finder
finding
findings
fine
finger
fingers
finish
finish thanks
finished
finishing
firm
firmly
firmware
first
firstly
fit
fits
five
fix
fixed
flash
flat
flaw
flawlessly
fledged
flimsy
flip
flipkart
floor
floors
fluctuating
fn
focus
folder
follow
followed
following
fool
foot
for
force
foremost
forget
forgot
form
format
formating
formatted
formatting
forums
forward
found
four
fr
fraud
free
freedom
frequency
frequent
frequently
friend
friendly
friends
frnz
from
front
frustrating
ft
fuel
fulfilled
full
full size
full sized
fully
fun
function
functional
functionality
functioning
functioning  in
functions
funny
further
future
gadget
gadgets
galaxy
game
gamepad joystick
gamer
gamers
games
gaming
gave
gb
gen
general
gently
genuine
get
gets
getting
giant
gift
gigs
given
gives
giving
glad
glitch
glitches
go
god
goes
going
gon
gone
good
google
googled
got
gp
gr
grab
grand
gray
great
great  two
greater
green
grey
grip
grippy
ground
guarantee
gud
guess
guide
gujarat
guru
guy
guys
h test
h testw
h w
had
hai
half
hall
hand
handle
handling
hands
handy
hang
hanging
happen
happened
happens
happy
hard
hard core
hardly
hardware
has
hassle
hassle free
hassles
hate
hav
have
having
hd
hdtv
he
heard
heat
heated
heating
heats
heavy
held
hell
hello
help
helped
helpful
helps
hence
here
hesitate
hesitation
hey
hi
hiccups
high
higher
highest
highlight
highly
hit
hitman
hold
holding
home
home office
honest
honestly
hope
hopefully
hot
hotspot
hour
hours
house
how
however
hp
hr
hrs
htc
http
https
huge
hv
i e
iam
iball
id
idea
identified
ie
if
im
imac
image
images
imagine
immediately
imp
impact
implied
important
importantly
impression
impressive
improve
improvement
in
in built
inactive
inbox
inbuilt
inch
include
included
includes
including
increase
increased
increases
indeed
india
indian
indicate
indication
indicator
indicators
info
information
initial
initially
initiate
initiated
ink
input
inputs
inr
insert
inserted
inserting
inside
inspect
inspite
install
installation
installations
installed
installing
instead
insted
instruction
instructions
intact
intend
interface
internal
international
internet
internet connected
intervene
intro
invalid
invisible
involve
ios
ip
ipad
iphone
irregular
irritating
irritation
is
isp
issue
issues
it
it it
it the
item
items
its
itself
itsperfect
itz
iz
jabong
jan
jazz
jeyanth
job
jobs
join
joking
jst
july
june
junk
just
kali
kb
kb s
kbps
kbyte
keep
keeping
keeps
kept
key
keyboad
keyboard
keyboard but
keyboard mouse
keyboards
keyborad
keypad
keys
kids
kind
kinda
kindly
kingston
kit
kitkat
km
kms
knob
know
knowledge
known
korea
kudos
lab quality
lacking
lacks
lag
lagging
lags
lan
laptop
laptops
large
larger
laser
laser sharp
last
lasts
latch
late
later
latest
layer
layout
lazy
lcd
lead
leaked
least
leave
led
leds
left
length
lengthy
less
lesser
let
lets
letter
letters
letting
level
lexar
lg
life
light
lightening
lighter
lighting
lightning
lights
lightweight
ligthweight
like
liked
likely
lil
lime
limit
limitations
limited
line
lines
link
links
linksys
linux
listed
listen
listing
literally
little
live
living
ll
load
loading
loads
local
located
location
locations
lock
locking
locks
log
logitech
logo
long
longer
looked
looking
looks
loop
loose
losing
loss
lost
lot
lots
love
loved
loving
low
lower
lowest
ltd
luck
luckily
lumia
ma
mac
macbook
machine
macosx
made
mail
main
mainly
major
make
makers
makes
makhkhan
making
malfunctioning
man
manage
managed
managing
manish
manual
manually
manufactured
manufacturer
manufacturers
many
mark
market
match
material
matte
matter
matters
max
maximum
may
maybe
mb
mb mp  d
mb mp  d in
mb s
mb sec
mbps
mbps it
mbs
mbyte
mbyte s
me
mean
meaning
means
meant
mechanism
media
mediatek
medium
meet
meeting
meets
memories
memory
mention
mentioned
mentioning
menu
mess
message
met
metal
metallic
meters
mhotspot
mice
micro
microsd
microsdhc
microsoft
middle
might
min
mind
mine
mini
minimise
minimum
minor
mins
mint
minute
minutes
mismatch
misplacing
miss
missed
missing
mistake
mk
mob
mobile
mobiles
mode
model
models
modem
moderate
modify
moment
monday
money
month
months
more
moreover
most
mostly
motion
moto
mount
mounting
mouse
mouse keyboard
move
moved
movement
moves
movie
movies
mp
mrp
ms
mtnl
much
multimedia
multinational
multiple
mumbai
music
must
mute
my
myntra
myself
na
name
nani
nano
narrow
nation
nd
ne
near
nearby
nearely
nearly
neat
need
needed
needs
negative
neglected
neither
net
netgear
network
networks
never
nevertheless
new
next
nexus
nice
nicely
night
nishal
no
nob
noise
noiseless
noisy
nokia
non
non detachable
none
noobs
nor
normal
normally
not
note
notebook
noted
nothing
notice
noticed
notification
nov
now
nt
ntfs
num
number
numbers
numeric
numlock
observed
obstacles
obstructions
obvious
obviously
oct
of
ofcourse
off
offer
offering
offers
office
official
offline
often
ok
okay
okk
old
older
on
on off
once
one
oneplus
ones
online
only
onwards
op
open
opened
opening
opens
operate
operating
operation
operations
opinion
optic
optical
optics
option
options
or
orange
order
ordered
ordering
original
os
osd
osm but
otg
other
others
otherwise
othwise
output
outside
over
overall
own
p s
pack
package
packaged
packaging
packed
packet
packing
packs
pad
page
pages
paid
pain
painful
paired
palm
pan
panel
paper
parcel
part
particular
particularly
partners
parts
passed
passport
password
past
pasted
pathetic
patriot
pause
pause b
pay
paying
payment
paytm
pc
pd
pdf
peeled
pen
pen drive
pendrive
pendrives
penny
people
per
perfect
perfectly
perfomance
perform
performance
performed
performing
performs
period
permanently
persia
person
personal
personally
persons
philippines
phillippines
phone
phones
photo
photocopy
photographs
photos
physical
physically
pi
pic
pick
picked
picking
pickup
picture
pictures
piece
pin
ping
place
placed
places
placing
plan
planning
plastic
platform
play
player
playing
pleasant
pleasantly
please
pleased
pleasure
pls
plug
plugged
plus
plz
pm
pny
pocket
point
pointer
points
policy
politely
polythene
poor
port
port  i
portable
portable  the
portal
portion
ports
pose
position
positive
possible
possibly
post
posted
posting
posts
potential
power
powerful
ppoe
pppoe
pre defined
precious
precision
prefer
preferred
premium
prepared
present
presentation
press
pressed
pressing
presume
pretty
previous
previously
price
priced
prices
pricey
pricing
primarily
prince
print
printables
printed
printer
printers
printing
printout
printouts
prints
prior
pristine
pro
prob
probably
problem
problems
procedure
process
produce
producer
produces
product
product so
products
professional
profitable
programmer
project
projection
projects
prolonged
promised
prompt
promptly
prone
proof
proper
properly
properties
pros
protect
protected
protection
protects
proved
provide
provided
provider
providers
provides
providing
ps
pune
purchase
purchased
purchasing
pure
purpose
purposes
push
pushed
put
putting
pvt
quality
quest
question
questions
quick
quickly
quiet
quite
r   w
racing
radiation
radio
ram
ran
random
range
range  fast
ranging
rarely
raspberry
raspberrypi
raspbian
rate
rated
rates
rather
rating
raw
rd
re
reach
reached
read
read write
reader
reading
ready
real
realize
realized
really
realtek
realy
rear
reason
reasonable
reasons
receipt
receive
received
receiver
receiving
reception
recieve
recieved
recognise
recognised
recommend
recommended
record
recording
recovered
recovering
red
reddish
reduce
reduced
refer
refers
refill
refund
refunded
refused
refuses
regarding
register
registered
registering
registration
regret
regrets
regular
related
relatively
release
reliability
reliable
remained
remains
remember
reminds
remote
remotely
remove
removed
removing
rendered
repair
repaired
repeater
replace
replaced
replaced repaired resolved
replacement
replaces
replacing
reply
report
reported
reputed
request
requested
require
required
requirement
requirements
research
reset
resolution
resolve
respect
respective
respond
responding
response
responsibility
responsible
responsive
rest
restart
result
resulting
results
retail
retailer
retract
return
returned
returning
returns
review
review this
reviewed
reviewers
reviews
right
rigid
risk
rj
road
roller
roof
room
rooms
rough
round
router
routers
row
rs
rumors
run
running
runs
rupee
rupees
sadly
safe
safety
said
sale
sales
same
samsung
samsung com
san
sandisk
satisfaction
satisfactorily
satisfactory
satisfied
satisfy
save
saved
saves
saving
savings
saw
saying
says
scale
scan
scanned
scanner
scanning
scans
scenario
sceptical
schedule
scheduled
school
scr
screen
scroll
scrolling
sd
sdhc
sealed
seamless
seamlessly
search
searched
searching
second
secondary
secondly
seconds
section
sectors
secure
secured
securely
security
seeing
seem
seemed
seems
seen
segment
select
selecting
self
sell
seller
sellers
selling
send
sending
sense
sensing
sensitivity
sensor
sent
sep
separate
september
sequential
serial
series
serious
seriously
serve
served
server
serves
service
services
serving
set
set up
setpoint
setting
settings
setup
several
sexy
shake
shape
share
shared
shareit
sharing
sharp
shd
sheet
sheets
shelf
shell
shift
shiny
ship
shipped
shipping
shocking
shooter
shooting
shop
shopping
shops
short
shortcut
shorter
should
show
showed
showing
shown
shows
shut
shutoff
side
sided
sides
sign
signal
signals
significant
similar
simple
simply
simultaneously
since
single
sir
sit
site
sites
sits
sitting
six
size
sized
sleek
sleeps
slick
slide
slider
sliding
slight
slightly
slot
slow
slower
slowing
small
small  it
smaller
smart
smart phones
smartphone
smartphones
smooth
smoothly
sms
snapdeal
sno
so
sock
sofa
soft
software
softwares
sold
solid
solution
solve
solved
som
some
someone
something
sometime
sometimes
somewhat
somewhere
son
songs
sony
soo
soon
sooner
sorry
sort
sorts
sound
south
space
spaced
span
speaking
special
specially
specific
specifically
specification
specified
specs
speed
speeds
speedtest net
speedy
spend
spending
spent
spill
spilt
spite
sq
sq ft
sqft
squeaky
squeky
st
stability
stable
standard
stands
star
stars
start
started
starting
starts
stated
static
status
stay
stays
steal
steel
step
steps
stick
sticker
sticking
sticks
still
stock
stop
stopped
stops
storage
store
stored
stores
storey
straight
straightforward
streaming
strength
strips
strong
strongly
struggling
stuck
students
stuff
sturdy
style
stylish
sub standard
submit
successfully
such
sucks
suddenly
sufficient
suggest
suggested
suggestion
suitable
suited
summary
super
superb
superb  device  keyboard
supplied
supplier
support
supported
supporting
supports
suppose
supposed
surat
sure
surely
surf
surfaces
surfing
surprise
surprised
swan
sweet
swiss
switch
switching
symbol
system
systems
tab
table
tablet
tablets
tabs
tactile
tad
tag
taiwan
take
taken
takes
taking
talk
talking
task
td w    nd
team
tech
technical
technically
technician
technology
tekken
tell
temporary
tend
tenda
tendency
tends
teri
terms
terrace
terrible
test
tested
testing
tests
text
th
than
thank
thanks
that
thats
the
then
theoretically
there
therefore
these
they
thier
thing
things
think
thinking
third
this
those
though
thought
thoughts
thousands
thread
three
through
throughout
thumb
thumbs
thuuuu
tie
tight
tightly
till
time
timely
times
timing
tiny
tl
tl wr   n
to
today
together
told
too
took
tools
top
total
totally
touch
touches
tough
town
toyed
tp
tp link
tplink
tracking
tranfer
transcend
transfer
transferred
transferring
transmission
transmitter signal
transportable  good
transportation
travel
tray
tried
trouble
true
truly
trust
trusted
trustworthy
try
trying
turbo
turn
turned
turns
tv
twice
two
tym
type
types
typical
typing
ubuntu
uhs
uhs i
uhs ii
ui
ultimate
ultra
unable
unbelievable
unboxing
uncomfortable
unconventional
under
understand
undoubtedly
unfortunately
unhappy
uni directional
unifying
unit
units
unless
unlike
unprofessional
until
untill
up
update
updates
upgrade
upgraded
upgrading
upload
uploaded
upon
upto
ur
urgently
us
usability
usable
usage
usb
use
used
useful
useless
user
username
users
uses
uses if
using
usp
usual
usually
utility
utilize
utter
valid
valuable
value
variant
variants
varies
variety
various
vary
vault
ve
vendor
vendors
verdict
verified
verify
versa
version
versions
very
vfm
via
vice
video
video snap
videos
view
virtual
virtually
virus
visible
visit
visited
voids
vol
volume
voucher
w   m
wait
waiting
wakes
walk
wall
wallet
walls
wan
wanted
wants
warn
warning
warranty
warrenty
was
washed
washing
wastage
waste
wasted
wasting
watch
watching
water
ways
wd
wds
we
weak
weaker
web
webpages
website
week
weeks
weight
weird
well
went
were
west
whatever
whats
whatsoever
wheel
when
whenever
where
whether
which
while
white
whole
whom
whose
why
wi fi
wid
wide
width
wifi
will
willl
win
window
windows
winner
winxp
wire
wired
wireless
wirelessly
wires
wirless
wise
wish
wished
with
within
without
wizard
wlan
wo
wonder
wonderful
wondering
wont
word
words
work
worked
working
works
world
worried
worry
worst
worth
worthy
would
wps
wr
write
writing
writings
written
wrong
wrost
wrt
www raspberrypi org forums viewtopic php
x   x
xp
xperia
xray
ya
ye
yeah
year
years
yellowish
yes
yesterday
yet
you
your
yourself
youtu be nfumtrbttkq
youtube
yr
zebronics
zenfone
zeroed
