yes
thoroughly
flaws
films
cole
freedom
wonderfully
scenery
seen
where
composition
screen
thriller
quality
scamp
itself
angel
care
doing
childhood
to
black
natural
nice
life
hell
point
cardboard
almost
exactly
beautifully
remember
disaster
he
mess
each
wholesome
empty
is
case
jobs
perhaps
poorly
incredible
june
meaning
while
significant
attention
make
speed
write
torture
none
human
overacting
duet
reason
clever
mother
effective
ponyo
matter
lame
result
also
run
recent
again
south
morgan
etc
paid
hour
when
church
story
addition
assistant
stage
sound
amazing
example
writer
afraid
art
genuine
thought
nonsense
mercy
drago
expect
see
thrilled
notable
wanted
how
until
deserved
flynn
women
intelligence
basically
far
errol
bold
impressive
looked
running
feeling
world
astronaut
came
witty
effects
by
wish
reality
thoughts
cheesy
bunch
alexander
such
strong
place
go
drive
conflict
vomit
classic
supposedly
watching
stunning
important
bought
theater
watson
called
history
pitiful
style
costumes
level
fact
night
main
truly
dance
entirely
recommend
type
entire
cause
else
depth
job
eyes
pure
need
themselves
actresses
interesting
absolutely
since
keep
from
parents
weird
realistic
obvious
she
cult
chilly
wilkinson
comes
unconvincing
much
utterly
last
word
memorable
goes
graphics
understand
exquisite
takes
honestly
giallo
several
never
white
knew
plus
killer
try
laugh
does
aside
volcano
ability
lead
disturbing
but
although
high
know
spoil
enjoyable
mind
engaging
los
of
ranks
fifteen
relations
hill
there
owned
race
watkins
documentaries
seems
speak
fun
actors
estevez
unfortunately
artist
at
faux
worth
regret
paul
something
describe
emotions
actor
tale
together
excellent
control
sake
nature
lousy
dreams
many
betty
season
camera
imaginable
massive
trash
crazy
culture
senses
not
change
slightest
provoking
believable
began
disappointed
dramatic
whether
missed
whiny
begin
accused
occupied
children
today
remotely
pointless
amount
low
process
saw
nobody
totally
share
do
act
minutes
attempt
adaptation
lots
surprisingly
singing
interest
those
play
hitchcock
awful
noteworthy
masterpieces
action
mexican
played
flick
enjoy
martin
plays
edge
bored
pretentious
dislike
james
now
leave
note
wrong
final
lives
stanwyck
lost
delight
space
kids
lord
let
period
horror
element
documentary
connery
uninteresting
seeing
particularly
said
fantastic
emilio
versus
turn
happened
taylor
acted
though
fat
hollow
central
songs
even
parts
maybe
if
deserves
air
off
business
editing
spent
underneath
charm
brian
both
plot
this
book
plenty
under
hated
free
better
whom
series
greatest
gets
you
emily
call
mean
mouse
direction
including
handled
perfect
rent
years
feel
wo
neil
roles
find
laughable
cartoons
had
and
appearance
child
billy
moral
making
terribly
presents
cool
recommended
focus
camerawork
movies
pathetic
usual
line
ups
storyline
writing
embarrassing
anne
touching
liked
murdered
scene
actually
show
re
perfectly
real
rate
avoid
humour
keeps
cover
puppets
loneliness
tom
africa
directed
imaginative
terrible
abysmal
light
special
showed
another
whole
bullock
loved
original
stereotypes
coming
works
still
having
forces
time
paced
explain
understated
received
overall
fit
moments
top
right
depicts
ways
psychological
waste
production
indeed
heaven
dedication
beyond
bother
redeeming
ll
sleep
disappointment
narrative
favourite
badly
starts
were
money
beginning
superb
produced
one
film making
stand
setting
sure
second
idea
everyone
offers
racial
times
remake
stay
visual
memories
very
rest
camera work
film
america
peter
turned
released
putting
new
felt
walked
lange
ever
intelligent
advise
sum
just
characters
nt
casting
ca
worse
three
genius
pull
glad
junkyard
face
towards
seemed
return
has
cinema
too
de
started
looking
someone
minute
working
wonderful
joy
pleased
often
master
an
really
shot
stars
piece
water
impressed
comedy
places
jimmy
suspense
movie
appealing
heart
created
scared
glance
gave
pretty
sucks
considering
reactions
review
journey
hope
big
they
modern
pm
director
heard
balance
costs
especially
american
plain
humorous
taped
young
brilliance
member
pieces
part
likes
wayne
what
single
father
undoubtedly
steve
enough
smile
situation
unbelievable
smart
flawed
crafted
among
garbage
half
opened
score
believe
lazy
wall
along
in
bad
talk
fresh
hands
italian
boring
early
annoying
trilogy
complex
problem
hard
mishima
left
frankly
remaining
lucy
scenes
moving
finally
lacked
end
doctor
viewing
home
without
frightening
it
blood
uplifting
fx
old
either
holes
attempts
exceptional
proud
conclusion
death
dialogue
interested
energy
why
fine
serious
super
grace
aspect
age
people
mickey
lot
should
take
game
ending
sequence
jamie
scale
yeah
cheap
soul
already
achievement
same
coppola
thrown
seem
leaves
man
due
dangerous
core
visually
whatsoever
summary
weak
entertaining
dogs
asleep
checking
things
ruthless
robert
which
pg
fans
nothing
easily
lion
hackneyed
industry
throughout
self indulgent
lacks
huge
brilliant
warmth
head
relationships
few
family
excellently
chance
references
myself
games
filmed
sort
acting
start
angles
nuts
tell
lines
pictures
watched
angeles
female
charming
guess
killing
subtle
moment
clearly
theme
short
era
given
somewhat
earth
losing
budget
performance
dumb
dull
god
christmas
shed
good
oscar
predictable
going
damn
instead
masterful
the
watch
least
quinn
decent
shakespear
room
portrayal
odd
future
unrecognizable
anything
incredibly
reviewer
computer
terrific
revealing
loads
follow
issues
every
script
location
surrounding
supposed
question
complete
best
got
directorial
gem
experience
helps
fox
hence
footage
charles
unfolds
appalling
barely
ratings
sublime
sea
brain
mediocre
solid
anyone
continuity
little
jerky
chick
store
ve
fan
player
recently
turns
worst
sand
yet
set
found
guy
ready
lovely
fast
become
possible
five
sisters
so
insult
mad
french
soundtrack
earlier
became
taking
oh
certainly
negative
away
put
talent
seriously
being
must
small
john
then
looks
written
occasionally
girl
unfunny
premise
house
done
always
painful
depressing
mature
identify
jonah
hate
levels
needed
shows
mention
war
ray
unpredictable
values
reading
silent
makes
miyazaki
macbeth
schrader
talented
despite
no
form
ten
particular
her
drama
presence
more
around
my
evil
contained
performances
screenwriter
friends
all
sucked
century
clichés
happen
cost
learn
poor
sets
proceedings
highly
problems
did
th
sense
length
horrible
shame
mark
disappointing
kind
predictably
kinda
themes
fall
material
may
dancing
poetry
superbly
huston
great
cast
thing
struck
previous
stories
canada
hilarious
thinking
chemistry
long
opening
animation
wooden
fulci
discovering
delivers
bore
down
full
fear
next
pacing
might
courtroom
involved
above
fascinating
definitely
sometimes
underlying
decay
ed
brief
stinks
bring
course
step
probably
during
gripping
european
hollywood
beautiful
wind
front
obviously
cartoon
ridiculous
disliked
lane
however
studio
surprising
gon
possibly
credit
his
rather
playing
made
masterpiece
generally
joke
forget
between
took
told
bit
like
following
twice
with
ago
fails
as
literally
character
delivering
spoiler
creates
own
offensive
stupid
create
deeply
ceases
cinematography
whatever
compelling
wonder
features
uses
jean
extremely
actress
music
been
completely
choice
enjoyed
different
tv
wasted
role
used
before
through
ask
watchable
explanation
here
americans
mostly
slow
appreciate
average
suffering
sick
imagination
awesome
convincing
everything
interplay
twist
less
dvd
shots
popular
portraying
joe
terms
guys
for
tremendously
picture
simply
scary
song
easy
dialog
quite
tension
lighting
audience
true
directing
flat
hours
dead
that
living
bear
sentiment
adorable
past
dark
racism
overly
contrast
about
consider
hear
star
gives
implausible
trying
sandra
son
contains
directors
daughter
love
spoilers
aerial
photography
rating
na
episode
funny
deserving
crap
words
machine
sucked the
movies ever
really bad
the plot
the characters
ve ever
very disappointed
the film
nt waste
the story
this film
do nt
very good
ever seen
movie bad
movie has
film made
the wind
characters were
movies ve
saw film
very very
film the
it very
movie like
real life
around pm
wind lion
of the
movie not
recommend movie
too much
films ever
film not
not bad
hour half
this movie
ca nt
nt understand
this definitely
worth checking
excellent film
ve seen
years the
waste time
movie it
nt really
long time
story line
sound effects
ray charles
special effects
bad film
film great
every single
ever made
movie really
acting bad
and nt
looked like
very bad
nt believe
definitely worth
watching film
very little
scene movie
film bad
good actors
film has
mess the
nt know
bad the
it too
not good
did nt
tom wilkinson
in fact
three films
black white
no plot
highly recommended
movies like
the directing
great director
not funny
short film
the script
nt make
bad nt
bad script
the acting
characters interesting
found myself
scenes were
annoying the
but movie
seen movie
pretty much
great film
the cast
good film
excellent job
so bad
the best
it has
cover girl
does nt
wo nt
the dialogue
time the
worth seeing
the show
the movie
