ability
about
above
absolutely
abysmal
accused
achievement
act
acted
acting
action
actor
actors
actress
actresses
actually
adaptation
addition
adorable
advise
aerial
afraid
africa
again
age
ago
air
alexander
all
almost
along
already
also
although
always
amazing
america
american
americans
among
amount
an
and
angel
angeles
angles
animation
anne
annoying
another
anyone
anything
appalling
appealing
appearance
appreciate
around
art
artist
as
aside
ask
asleep
aspect
assistant
astronaut
at
attempt
attempts
attention
audience
average
avoid
away
awesome
awful
bad
badly
balance
barely
basically
bear
beautiful
beautifully
became
become
been
before
began
begin
beginning
being
believable
believe
best
better
betty
between
beyond
big
billy
bit
black
blood
bold
book
bore
bored
boring
both
bother
bought
brain
brian
brief
brilliance
brilliant
bring
budget
bullock
bunch
business
but
by
ca
call
called
came
camera
camera work
camerawork
canada
cardboard
care
cartoon
cartoons
case
cast
casting
cause
ceases
central
century
certainly
chance
change
character
characters
charles
charm
charming
cheap
checking
cheesy
chemistry
chick
child
childhood
children
chilly
choice
christmas
church
cinema
cinematography
classic
clearly
clever
clichés
cole
comedy
comes
coming
compelling
complete
completely
complex
composition
computer
conclusion
conflict
connery
consider
considering
contained
contains
continuity
contrast
control
convincing
cool
coppola
core
cost
costs
costumes
course
courtroom
cover
crafted
crap
crazy
create
created
creates
credit
cult
culture
damn
dance
dancing
dangerous
dark
daughter
de
dead
death
decay
decent
dedication
deeply
definitely
delight
delivering
delivers
depicts
depressing
depth
describe
deserved
deserves
deserving
despite
dialog
dialogue
did
different
directed
directing
direction
director
directorial
directors
disappointed
disappointing
disappointment
disaster
discovering
dislike
disliked
disturbing
do
doctor
documentaries
documentary
does
dogs
doing
done
down
drago
drama
dramatic
dreams
drive
due
duet
dull
dumb
during
dvd
each
earlier
early
earth
easily
easy
ed
edge
editing
effective
effects
either
element
else
embarrassing
emilio
emily
emotions
empty
end
ending
energy
engaging
enjoy
enjoyable
enjoyed
enough
entertaining
entire
entirely
episode
era
errol
especially
estevez
etc
european
even
ever
every
everyone
everything
evil
exactly
example
excellent
excellently
exceptional
expect
experience
explain
explanation
exquisite
extremely
eyes
face
fact
fails
fall
family
fan
fans
fantastic
far
fascinating
fast
fat
father
faux
favourite
fear
features
feel
feeling
felt
female
few
fifteen
film
film making
filmed
films
final
finally
find
fine
fit
five
flat
flawed
flaws
flick
flynn
focus
follow
following
footage
for
forces
forget
form
found
fox
frankly
free
freedom
french
fresh
friends
frightening
from
front
fulci
full
fun
funny
future
fx
game
games
garbage
gave
gem
generally
genius
genuine
gets
giallo
girl
given
gives
glad
glance
go
god
goes
going
gon
good
got
grace
graphics
great
greatest
gripping
guess
guy
guys
hackneyed
had
half
handled
hands
happen
happened
hard
has
hate
hated
having
he
head
hear
heard
heart
heaven
hell
helps
hence
her
here
high
highly
hilarious
hill
his
history
hitchcock
holes
hollow
hollywood
home
honestly
hope
horrible
horror
hour
hours
house
how
however
huge
human
humorous
humour
huston
idea
identify
if
imaginable
imagination
imaginative
implausible
important
impressed
impressive
in
including
incredible
incredibly
indeed
industry
instead
insult
intelligence
intelligent
interest
interested
interesting
interplay
involved
is
issues
it
italian
itself
james
jamie
jean
jerky
jimmy
job
jobs
joe
john
joke
jonah
journey
joy
june
junkyard
just
keep
keeps
kids
killer
killing
kind
kinda
knew
know
lacked
lacks
lame
lane
lange
last
laugh
laughable
lazy
lead
learn
least
leave
leaves
left
length
less
let
level
levels
life
light
lighting
like
liked
likes
line
lines
lion
literally
little
lives
living
ll
loads
location
loneliness
long
looked
looking
looks
lord
los
losing
lost
lot
lots
lousy
love
loved
lovely
low
lucy
macbeth
machine
mad
made
main
make
makes
making
man
many
mark
martin
massive
master
masterful
masterpiece
masterpieces
material
matter
mature
may
maybe
mean
meaning
mediocre
member
memorable
memories
mention
mercy
mess
mexican
mickey
might
mind
minute
minutes
mishima
missed
miyazaki
modern
moment
moments
money
moral
more
morgan
mostly
mother
mouse
movie
movies
moving
much
murdered
music
must
my
myself
na
narrative
natural
nature
need
needed
negative
neil
never
new
next
nice
night
no
nobody
none
nonsense
not
notable
note
noteworthy
nothing
now
nt
nuts
obvious
obviously
occasionally
occupied
odd
of
off
offensive
offers
often
oh
old
one
opened
opening
original
oscar
overacting
overall
overly
own
owned
paced
pacing
paid
painful
parents
part
particular
particularly
parts
past
pathetic
paul
people
perfect
perfectly
performance
performances
perhaps
period
peter
pg
photography
picture
pictures
piece
pieces
pitiful
place
places
plain
play
played
player
playing
plays
pleased
plenty
plot
plus
pm
poetry
point
pointless
ponyo
poor
poorly
popular
portrayal
portraying
possible
possibly
predictable
predictably
premise
presence
presents
pretentious
pretty
previous
probably
problem
problems
proceedings
process
produced
production
proud
provoking
psychological
pull
puppets
pure
put
putting
quality
question
quinn
quite
race
racial
racism
ranks
rate
rather
rating
ratings
ray
re
reactions
reading
ready
real
realistic
reality
really
reason
received
recent
recently
recommend
recommended
redeeming
references
regret
relations
relationships
released
remaining
remake
remember
remotely
rent
rest
result
return
revealing
review
reviewer
ridiculous
right
robert
role
roles
room
run
running
ruthless
said
sake
same
sand
sandra
saw
scale
scamp
scared
scary
scene
scenery
scenes
schrader
score
screen
screenwriter
script
sea
season
second
see
seeing
seem
seemed
seems
seen
self indulgent
sense
senses
sentiment
sequence
series
serious
seriously
set
sets
setting
several
shakespear
shame
share
she
shed
short
shot
shots
should
show
showed
shows
sick
significant
silent
simply
since
singing
single
sisters
situation
sleep
slightest
slow
small
smart
smile
so
solid
someone
something
sometimes
somewhat
son
song
songs
sort
soul
sound
soundtrack
south
space
speak
special
speed
spent
spoil
spoiler
spoilers
stage
stand
stanwyck
star
stars
start
started
starts
stay
step
stereotypes
steve
still
stinks
store
stories
story
storyline
strong
struck
studio
stunning
stupid
style
sublime
subtle
such
sucked
sucks
suffering
sum
summary
super
superb
superbly
supposed
supposedly
sure
surprising
surprisingly
surrounding
suspense
take
takes
taking
tale
talent
talented
talk
taped
taylor
tell
ten
tension
terms
terrible
terribly
terrific
th
that
the
theater
theme
themes
themselves
then
there
they
thing
things
thinking
this
thoroughly
those
though
thought
thoughts
three
thrilled
thriller
through
throughout
thrown
time
times
to
today
together
told
tom
too
took
top
torture
totally
touching
towards
trash
tremendously
trilogy
true
truly
try
trying
turn
turned
turns
tv
twice
twist
type
unbelievable
unconvincing
under
underlying
underneath
understand
understated
undoubtedly
unfolds
unfortunately
unfunny
uninteresting
unpredictable
unrecognizable
until
uplifting
ups
used
uses
usual
utterly
values
ve
versus
very
viewing
visual
visually
volcano
vomit
walked
wall
wanted
war
warmth
waste
wasted
watch
watchable
watched
watching
water
watkins
watson
wayne
ways
weak
weird
were
what
whatever
whatsoever
when
where
whether
which
while
whiny
white
whole
wholesome
whom
why
wilkinson
wind
wish
with
without
witty
wo
women
wonder
wonderful
wonderfully
wooden
word
words
working
works
world
worse
worst
worth
write
writer
writing
written
wrong
yeah
years
yes
yet
you
young
